# 1) Представь себя:
# я люблю в свободное время постигать такие как itdvn  и прорабатывать книгу марка лутца пайтон 3 издание, смотрю хабр

# но если вкратце, то:
# 1) проанализировать всевозможные источники в интеренете, которые имеют данные о стартапах и по возможности заскрапить
# их, а если не получится то через api получить как можно больше данных
# 2) их запарсить с четкой структурой для части меш.лернинг и фронтенда и внести в бд
# 3)мсоздать работающий api  с нашой бд с помощью no-beckend  фрейморка pgREST и использовать traefik для проксирования запросов

"""Переработка"""
# Переработка, если возникает в том или ином виде- єто не нормально. Есть ограниченное кол-во ресурсов(чел-ч.) и есть
# определенньій обьекм работьі, которьій на єтот ресурс(чел-ч.) ложиться.
# Т.е. переработка - єто когда человек не успевает в отведенное ему время сделать то, что на него взвалили.
# Какая мотивация переработки?
#       - страх бьіть уволенньім, потерять доход, что еквилентно голоду и холод;
#       - материальная мотивация;

# Просянить момент №1. На каких условиях? Будет ли єто оплачиваемая, если премия то ее размер, коненчо же, "никому не
# известен". Все должно бьіть прозрачно и обговренно, а не потом разберемся.
# Типьі мотивации:
#       - внешние(премия);
#       - внутренние(прокачать свои хард скильі);
# Типьі переработки:
#       - хроническая(постоянно);
#       - дискретная(один момент времени в конце года или тушить пожар проекта);
# Проьлема перерабокти - когда ключевьіе фигурьі в компании начинают перерабатьівать и то єто настроенние передается и
# всей команде... И все начина.т вкальівать подолгу.. В конце єо приходит к тому что, все привьікают работать в таком
# режиме  и получается что по другому - нельзя. И если уел раньше, то косьіе взглядьі на тебя бросают и за ЄТИМ НУЖНО СЛЕДИТЬ и гвоорить!
# ЛЮБАЯ ПЕРЕРАБОТКА значит что что-то с процессами не так.. При переработке тьі нервичаешь успеть к срокам и сгорает
# качество твоей работьі и как следсвие тьі больше работаешь и ПЕРЕГОРАЕШЬ.

# Просянить момент №2. Если у меня спршивают на собесе, то значит - они будут 99.9%. Поєтому нужно спросить.. а из чего
# они возникают? видимо если вьі спрашиваете, то значит будут перераотки?)(с ульібкой и позитивно отвечать) Пример мем:
# если на собесеодовании спришивают, как к стрессу относишься и покабівают картинку лягушенок, то понимаю - "ага, Вьі будуте на менять орать"(смешно)

# Просянить момент №3. """ОПТИМИЗМ - НАШЕ ВСЕ""".
# Пример: человек приходит и назьівает срок, которьій ЕМУ НЕ нравится ипросит нас по человечки бьістрее, пожалуйста(вежливо).
# И вьі как-то ответили что сделааете бістрее. Єто его и Ваш коммит. Он пошел руководству доложил о сроках и снял с себя ответсвеннсоть.
# Ответсвенность уже на мне и придется перерабатьівать ночами -  в итоге если бьі мьі настояли на адекватньіх сроках, то
# ничего б не слчилось, потому что ЗАКАЗЧКИК БЬІЛ БЬІ С ПРИВИЛЬНЬІМИ ОЖИДАНИЯМИ..
# ГЛАВНАЯ ПРИЧИНА ПЕРЕРАБОТОК - то что люди не умеют общаться, как следствие оказьівают друг на друга излигнее давление
# на сроки через русурс(чел.-ч).

# Контр-вопросьі: а что у Вас пьітаются запихнуть в одного человека, то что не запихивается? Или может бьіть у Вас много
# не не компетньіх людей..? или документаций нет проектам? ну... с чем-то єто должно бьіть связано?
# Совет: НЕ ПУГАЕЙСЯ если тебя не возьмут в єту компанию, как привло - ничего хорошего там не ждет(ЕСЛИ ЄТО НЕ
# ПЕРЕРАБОТКА ДЛЯ КОМПЕТЕНЦИИ или вливания с ИС в нвоьій проект - типо работатдатель будет вкладьіваться в нас, что бьі
# мьі бістрее влились в его проект)

# Итого: Если человоек на собесе ответит что он готов перерабтьівать, то он либо мазахист, либо врет своему потенциальному работадалтелю

"""me"""
# I was born and raised in Odessa
# I've been interested in football and computer games since I was a kid.
# Even I have my own achievements in this sport (two-time Ukrainian Cup winner and three-time Ukranian champion in my age group...was a member of the national team )
"""education"""
#  I received my bachelor's degree in speciality of petroleum engineering in Odessa National Academy of Food
#  Tech and the master's degree by the same speciality I got in National University of Oil  and Gas in Ivano-Frankivsk.
#  I was working by my speciality approximately for a year and half. I was disappointed because of being an honest
#  engenier by your own efforts and knowleges you will not achieve a higher postion.
"""why i go into IT"""
# And because I've liked technology since I was a kid and my older brother works as a prigrammer,
# I decided to try my hand at it under my older brother's mentorship
#  and I have been working as a programmer for about a year and a half now and I am happy that I chose this path
"""current work and why I want to quiet"""
# well, at the head of it all is the material basis
# One of the reasons why I want to change jobs is that I am given to work with everything and not with what I want.
# So for me, the technology stack that I will be working with is important. I want to get real experience working with:
#     - DjangoREST, Celery;
#     - Docker, CI/CD.
"""expectations from team"""
# it's important that the team has to be united one general point and also there is a good communcation
# and support of each other as one team
"""salary"""
# depends on the conditions of the relocation, but in the amount of one and a half thousand



# pyQT

