# 1) Представь себя:
# я люблю в свободное время постигать такие как itdvn  и прорабатывать книгу марка лутца пайтон 3 издание, смотрю хабр


# но если вкратце, то:
# 1) проанализировать всевозможные источники в интеренете, которые имеют данные о стартапах и по возможности заскрапить
# их, а если не получится то через api получить как можно больше данных
# 2)их запарсить с четкой структурой для части меш.лернинг и фронтенда и внести в бд
# 3)создать работающий api  с нашой бд с помощью no-beckend  фрейморка pgREST и использовать traefik для проксирования запросов
# 4) как результат вот (http://dev-postgrest.ledgity.com/dealroom) работающая  апи,