# Ссылка на ютуб плей-лист: https://www.youtube.com/watch?v=bUS7spptofo&t=143s&ab_channel=%D0%9F%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D0%B5%D0%B8%D0%B8%D0%B6%D0%B5%D1%81%D0%BD%D0%B8%D0%BC
# Ссылка на статью с хабра: https://habr.com/ru/post/422259/

"""Что такое структура данных?"""
# Структура данных — это контейнер, который хранит данные в определенном макете.
# Этот «макет» позволяет структуре данных быть эффективной в некоторых операциях и неэффективной в других.
"""Какие бывают?"""
#       - Линейные: элементы образуют последовательность или линейный список, обход узлов линеен
#               - Массивы.
#               - Связанный список
#               - стеки
#               - очереди
#       - Нелинейные: если обход узлов нелинейный, а данные не последовательны:
#               - граф
#               - деревья
"""Основные структуры данных."""
#   1) Массивы:Каждому элементу данных присваивается положительное числовое значение (индекс),
#   который соответствует позиции элемента в массиве. Большинство языков определяют начальный индекс массива как 0.
#   Єто самая простая и широко используемая структура данных. Другие структуры данных, такие как стеки и очереди,
#   являются производными от массивов.
#   Бывают:
#           - Одномерные
#           - Многомерные, массивы внутри массивов.
#   Основные операции:
#           - Insert-вставляет элемент по заданному индексу
#           - Get-возвращает элемент по заданному индексу
#           - Delete-удаление элемента по заданному индексу
#           - Size-получить общее количество элементов в массиве
#   2) Стеки: абстрактный тип данных, представляющий собой список элементов, организованных по принципу LIFO (last in — first out).
#   Примером стека может быть куча книг, расположенных в вертикальном порядке. Для того, чтобы получить книгу,
#   которая где-то посередине, вам нужно будет удалить все книги, размещенные на ней.
#   Основные операции:
#           - Push-вставляет элемент сверху
#           - Pop-возвращает верхний элемент после удаления из стека
#           - isEmpty-возвращает true, если стек пуст
#           - Top-возвращает верхний элемент без удаления из стека
#   3) Очереди
#   4) Связанные списки
#   5) Графы
#   6) Деревья
#   7) Префиксные деревья
#   8) Хэш таблицы








