'''Что такое "поисковый движок"'''
# (с википердии) - комплекс программ(его стэк), предназнченньій для поиска инфьі (google, yandex - используют их)
'''Elastic стэк: x-pack, beats, kibana, logstash, elasticsearch'''
#       - x-pack: мониторить, уведомлять и защищать;
#       - kibana: удобно глядеть и взаимодействовать;
#       - logstash: центрилизовать данньіе по собьітиям;
#       - elasticsearch: хранить, искать, обрабаотьівать.
'''О реляционных БД'''

'''О нереляционных БД'''

'''Плюсы Elasticsearch'''

'''Полнотекстовый поиск'''

'''Как установить Elastic'''
