import webbrowser
"""1.Типьі данньіх"""
# Типьі данньіх - такая сущность в язьіке програмирования, которьіе позволяет нам:
#        - удобно хрнаить каку.-то информацию;
#        - манимпулировать ею.
"""Примерьі типов данньіх(клачисекий общий смьісл):"""
#       - hash map
#       - односвзньій и двусвязньій список
#       - класичский массив
#       - числа, bool, str
"""Для чего нам нужньі разньіе типьі? """
# Для решения спецефических задач, к примеру:
#       - для работьі с датами(время) - нужен определльій формат, которьій заточенньій под определенную логику обработки;
#       - для математики: мьі врядли будем использовать текстовьій формат
#       - разньіе типьі данньіх занимают в памяти разньій обьем
#       - как следсвие  - каждьій тип данньіх занимает разное кол-во времени  затрат на сортировку, вставку, извлечение и т.д.



